<?php
require_once __DIR__ . "/vendor/autoload.php";
require_once __DIR__ . "/appVars.inc.php";

function main()
{
    $story = "شهید علی‌اکبر غیوری ثالث در اولین بهار زندگی خود به دنیا آمد، اما گویا دنیا به وی نیامد. او پنج‌سال بعد وارد دانشکده‌ی هنرهای زیبا شد و از همان اول از همسن و سال‌های خود حداقل سه سال بزرگ‌تر بود. علی اکبر قصه‌ی ما، با صدور فرمان جهاد توسط امام(عج) به دمشق رفت و از آنجا یکی یکی پله‌های ترقی را طی نموده و پزشکی قهار شد. او کسی نبود جز پروفسور سمیعی. این بزرگوار در رمضان المبارک سنه‌ی ۲۴ میلادی دریافت که برادری به اسم علی‌اصغر دارد. علی‌اصغر که ذوب در ولایت و سیادت برادر بود، حتی پروفایل پیکچرهایش را هم از بین عکسهای برادر انتخاب می‌کرد و این داستان تا حدی پیش رفت که وی را به دلیل شرک جلی به دار آویختند. علی‌اکبر که از مرگ برادر غمگین، خشمگین، سنگین و رنگین بود، فرار را بر قرار ترجیح داده و به سفارت انگلستان در سوئد پناهنده می‌شود. فرازی از وصیت‌نامه‌ی این عزیز را می‌خوانیم: «رضا ناموسا این بازی با رایانشو آماده کن.» خون آریایی تو رگات نیست اگه به اشتراک نذاری";

    $database = initDatabase();
    $database->delete("story", ["OR"=>["word_place"=>0, "word_place[!]"=>0]]);
    $words = explode(" ",$story);
    for($i = 0; $i < count($words); $i++)
    {
        $database->insert("story", ["word_place"=>$i, "word"=>$words[$i]]);
    }
    echo("done!");
}

main();
